[
    {
        "id": 1,
        "title": "Project One: How does hardware work?",
        "description": "In this project, my team and I constructed basic logic gates using transistors and other electronic components.",
        "fullDescription": "In this project, my team and I, in collaboration with other teams in some parts, constructed and tested three fundamental logic gates—NOT, AND, OR, NAND, and XOR—using a solderless breadboard and a kit of discrete components including PN2222 NPN transistors, various resistors, and pushbuttons. To understand the circuit design, we first did some research and watched explanatory videos. We then applied this knowledge to build the circuits sequentially, starting with the simpler NOT gate before assembling the more complex OR, AND, NAND, and XOR gates, utilizing LEDs to visually verify the correct logic output for each configuration..",
        "cardImage": "assets/images/project1-card.jpg",
        "image": "assets/images/project1.jpg",
        "status": "completed",
        "videoUrl": "https://www.youtube.com/embed/E_j6BvmugZY",
        "videoTitle": "NOT, AND, and OR Gates",
        "videoUrl2": "https://www.youtube.com/embed/K3gZlV5ObkE",
        "videoTitle2": "NAND Gate",
        "videoUrl3": "https://www.youtube.com/embed/vKR5APSiiIE",
        "videoTitle3": "XOR Gate"
    },
    {
        "id": 2,
        "title": "Project Two: Hour of Code",
        "description": "In this project, my team and I visited a secondary school and taught fundamental algorithms and computer science concepts to students.",
        "fullDescription": "As part of the 2025 Hour of Code global initiative, my team and I executed this project to bridge the digital divide by teaching fundamental algorithms and computer science concepts to students at Secondary School No. 27 in Sumgait. Our goal was to demystify artificial intelligence and programming for a group with limited access to these technologies. Using Microsoft MakeCode, we designed and delivered an engaging, hands-on workshop tailored to our audience’s needs. Beyond the technical instruction, I played a key role in delivering the curriculum, culminating in a recap documentary that highlighted the students' progress and celebrated their achievement with official certificates of completion.",
        "cardImage": "assets/images/project2-card.jpg",
        "image": "assets/images/project2.jpg",
        "status": "completed",
        "videoUrl": "",
        "videoTitle": "Hour of Code Recap Video",
        "videoUrl2": "",
        "videoTitle2": "",
        "videoUrl3": "",
        "videoTitle3": ""
    },
    {
        "id": 3,
        "title": "Project Three",
        "description": "Another amazing project coming soon!",
        "fullDescription": "This project is in the planning stages. Stay tuned for updates!",
        "cardImage": "assets/images/project3-card.jpg",
        "image": "assets/images/project3.jpg",
        "status": "coming-soon",
        "videoUrl": "",
        "videoTitle": "",
        "videoUrl2": "",
        "videoTitle2": "",
        "videoUrl3": "",
        "videoTitle3": ""
    }
]
